In [1]:
import pymysql
pymysql.install_as_MySQLdb()

%load_ext sql
%config SqlMagic.autocommit=True

connection_string = "mysql://root:simple@127.0.0.1"

In [2]:
%sql $connection_string

## Simple Queries

In [3]:
%%sql
use app

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [4]:
%%sql
SHOW TABLES

 * mysql://root:***@127.0.0.1
5 rows affected.

[('#add_on',), ('account',), ('credit_card',), ('purchase',), ('~log',)]

In [6]:
%%sql
SELECT * FROM account LIMIT 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(10007189411, 'Julia', 'Medina', datetime.date(1990, 10, 25)),
 (10019036667, 'Joseph', 'Mosley', datetime.date(1938, 11, 15)),
 (10022084083, 'Joseph', 'Oneal', datetime.date(1941, 7, 27)),
 (10029750284, 'Tonya', 'Mills', datetime.date(1915, 6, 19)),
 (10042163305, 'Danielle', 'Oneal', datetime.date(1995, 11, 6)),
 (10046907814, 'Howard', 'Jones', datetime.date(1937, 10, 6)),
 (10050855637, 'Steven', 'Yang', datetime.date(1947, 12, 3)),
 (10055394935, 'Christopher', 'Wagner', datetime.date(1924, 9, 12)),
 (10075751151, 'Austin', 'Oliver', datetime.date(1951, 3, 20)),
 (10076202140, 'David', 'Smith', datetime.date(1954, 2, 5))]

In [7]:
%%sql
SELECT * FROM account ORDER BY last_name DESC, first_name DESC LIMIT 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(17665106031, 'Sean', 'Zuniga', datetime.date(1998, 1, 13)),
 (48985875431, 'Nathaniel', 'Zimmerman', datetime.date(1986, 8, 1)),
 (92608516078, 'Michael', 'Zimmerman', datetime.date(1944, 11, 7)),
 (12281911253, 'Melissa', 'Zimmerman', datetime.date(1917, 1, 19)),
 (49095451501, 'Mark', 'Zimmerman', datetime.date(1914, 2, 11)),
 (19105564069, 'Lisa', 'Zimmerman', datetime.date(2021, 2, 4)),
 (32637920711, 'Joseph', 'Zimmerman', datetime.date(2016, 12, 2)),
 (57399656792, 'Joseph', 'Zimmerman', datetime.date(1908, 11, 23)),
 (78040193655, 'Cynthia', 'Zimmerman', datetime.date(1958, 9, 15)),
 (36856967976, 'Wayne', 'Zhang', datetime.date(1911, 8, 25))]

In [9]:
%%sql
SELECT * FROM account ORDER BY dob LIMIT 10 OFFSET 100

 * mysql://root:***@127.0.0.1
10 rows affected.

[(17680708238, 'Steven', 'Olson', datetime.date(1909, 1, 17)),
 (96976428284, 'Emily', 'Chavez', datetime.date(1909, 1, 17)),
 (92823308998, 'Sarah', 'Smith', datetime.date(1909, 1, 18)),
 (35596025225, 'Destiny', 'Diaz', datetime.date(1909, 1, 23)),
 (43417878595, 'Lisa', 'Hawkins', datetime.date(1909, 1, 23)),
 (32713540836, 'Jessica', 'Melendez', datetime.date(1909, 1, 31)),
 (36171242421, 'Anthony', 'Bradford', datetime.date(1909, 2, 10)),
 (60948825788, 'Stephen', 'Williams', datetime.date(1909, 2, 17)),
 (29171917435, 'Renee', 'Martinez', datetime.date(1909, 2, 20)),
 (14463053884, 'Carrie', 'Carroll', datetime.date(1909, 2, 21))]

## Restriction

In [11]:
%%sql
SELECT*
FROM account
where phone = 14463053884
limit 10

 * mysql://root:***@127.0.0.1
1 rows affected.

[(14463053884, 'Carrie', 'Carroll', datetime.date(1909, 2, 21))]

In [13]:
%%sql
select *
   from account
   where first_name = 'Michael'
   order by dob
   limit 10 offset 20

 * mysql://root:***@127.0.0.1
10 rows affected.

[(93097513802, 'Michael', 'Snyder', datetime.date(1922, 11, 10)),
 (52439994209, 'Michael', 'Pierce', datetime.date(1923, 4, 10)),
 (25790432015, 'Michael', 'Tate', datetime.date(1923, 5, 9)),
 (46074030084, 'Michael', 'Gray', datetime.date(1923, 6, 14)),
 (43426761993, 'Michael', 'Johnson', datetime.date(1924, 6, 6)),
 (45438130926, 'Michael', 'Jennings', datetime.date(1924, 8, 21)),
 (72772063632, 'Michael', 'Smith', datetime.date(1924, 11, 25)),
 (34191154563, 'Michael', 'Ross', datetime.date(1925, 1, 15)),
 (49138800691, 'Michael', 'Kelly', datetime.date(1925, 2, 9)),
 (14659049818, 'Michael', 'Brown', datetime.date(1925, 3, 23))]

In [15]:
%%sql
select *
from account
where first_name = 'Sarah' and dob > '2001=01-01' 
limit 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(14810708344, 'Sarah', 'Decker', datetime.date(2016, 9, 29)),
 (16116026138, 'Sarah', 'Turner', datetime.date(2006, 11, 29)),
 (19111837696, 'Sarah', 'Smith', datetime.date(2001, 6, 14)),
 (26140087763, 'Sarah', 'Bell', datetime.date(2007, 5, 30)),
 (33591877926, 'Sarah', 'Osborne', datetime.date(2013, 6, 30)),
 (41196741279, 'Sarah', 'Lopez', datetime.date(2002, 3, 3)),
 (45532227421, 'Sarah', 'Barron', datetime.date(2012, 9, 30)),
 (49984579891, 'Sarah', 'Hill', datetime.date(2015, 1, 13)),
 (57567460663, 'Sarah', 'Diaz', datetime.date(2014, 5, 4)),
 (60574181354, 'Sarah', 'Greene', datetime.date(2021, 2, 17))]

In [51]:
%%sql
select *
from account
where DATEDIFF(now(), dob) >= 300
limit 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(10007189411, 'Julia', 'Medina', datetime.date(1990, 10, 25)),
 (10019036667, 'Joseph', 'Mosley', datetime.date(1938, 11, 15)),
 (10022084083, 'Joseph', 'Oneal', datetime.date(1941, 7, 27)),
 (10029750284, 'Tonya', 'Mills', datetime.date(1915, 6, 19)),
 (10042163305, 'Danielle', 'Oneal', datetime.date(1995, 11, 6)),
 (10046907814, 'Howard', 'Jones', datetime.date(1937, 10, 6)),
 (10050855637, 'Steven', 'Yang', datetime.date(1947, 12, 3)),
 (10055394935, 'Christopher', 'Wagner', datetime.date(1924, 9, 12)),
 (10075751151, 'Austin', 'Oliver', datetime.date(1951, 3, 20)),
 (10076202140, 'David', 'Smith', datetime.date(1954, 2, 5))]

In [19]:
%%sql
SELECT * FROM account WHERE dob BETWEEN '1978-01-01' AND '1997-01-01' AND first_name='Michael' LIMIT 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(15000185343, 'Michael', 'Long', datetime.date(1982, 10, 22)),
 (17013923839, 'Michael', 'Russell', datetime.date(1991, 12, 22)),
 (27656240383, 'Michael', 'Long', datetime.date(1979, 9, 16)),
 (31933870220, 'Michael', 'Cooper', datetime.date(1979, 9, 5)),
 (35761639823, 'Michael', 'Hernandez', datetime.date(1990, 12, 16)),
 (40607418326, 'Michael', 'Freeman', datetime.date(1990, 4, 14)),
 (42818290896, 'Michael', 'Mccoy', datetime.date(1984, 9, 8)),
 (43328168563, 'Michael', 'Hodge', datetime.date(1996, 1, 18)),
 (45950519708, 'Michael', 'Rosales', datetime.date(1978, 7, 13)),
 (49545721638, 'Michael', 'Williams', datetime.date(1984, 5, 14))]

## Assignment_Queries

In [35]:
%%sql
-- 1. All accounts last_names for persons named "Paul" or "Parla" born in the 1990s
SELECT *
FROM account
WHERE (first_name = 'Paul' OR  first_name ='Paula')
AND YEAR(dob) BETWEEN 1990 AND 1999

 * mysql://root:***@127.0.0.1
5 rows affected.

[(10691751311, 'Paula', 'Carey', datetime.date(1994, 6, 18)),
 (20891313915, 'Paul', 'Phillips', datetime.date(1998, 6, 16)),
 (66711962672, 'Paula', 'Reynolds', datetime.date(1993, 2, 20)),
 (75255732152, 'Paul', 'Sanchez', datetime.date(1995, 1, 22)),
 (98122881201, 'Paula', 'Bailey', datetime.date(1999, 6, 26))]

In [48]:
%%sql
-- SHOW the 10 youngest males whose last names start with 'Ra'

SELECT first_name, last_name, dob
FROM account
WHERE last_name LIKE 'Ra%' and dob DESC
LIMIT 10;

 * mysql://root:***@127.0.0.1
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'DESC\nLIMIT 10' at line 5")
[SQL: -- SHOW the 10 youngest males whose last names start with 'Ra'

SELECT first_name, last_name, dob
FROM account
WHERE last_name LIKE 'Ra%%' and dob DESC
LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [59]:
%%sql
-- show full names of the people who omitted their date of birth. Sort them alphabetically by last name/first name. limit to 10 only

SELECT phone, concat(' ', last_name, first_name) as full_name 
FROM account
WHERE dob IS NULL
ORDER BY full_name
limit 10

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [65]:
%%sql
-- show the full names of all females born in June, also showing their age in years. Sort by last name/first name and limit to 10

SELECT phone, concat(' ', last_name, first_name) as full_name, floor(DATEDIFF(now(), dob)/365.25) age
FROM account
ORDER BY full_name
LIMIT 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(96693863530, ' AbbottAnthony', 40),
 (94265959146, ' AbbottAudrey', 114),
 (55276972441, ' AbbottDeborah', 51),
 (84002298166, ' AbbottJeffrey', 34),
 (82106806553, ' AbbottLaura', 82),
 (41666660071, ' AcevedoDustin', 66),
 (34034746389, ' AcevedoGwendolyn', 99),
 (63236543362, ' AcevedoHeather', 55),
 (94171957720, ' AcevedoLaurie', 64),
 (51651078107, ' AcevedoTeresa', 33)]